app/controllers/confirmations_controller.rb

	def show
		user = User.find_by(confirmation_token: params[:token])
---
SELECT "users".* FROM "users" WHERE "users"."confirmation_token" = 'xF8lYM1xaR3nX1-CJ--y2w' LIMIT 1