app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("created_at", "description", "location", "title", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @room = Room.new(room_params)

    if @room.save